---
kind: method
id: M:Autodesk.Revit.DB.ValidateCurveLoopsOptions.Dispose
source: html/101ed40c-d9f7-a7e6-c939-78f161415b16.htm
---
# Autodesk.Revit.DB.ValidateCurveLoopsOptions.Dispose Method

Releases all resources used by the ValidateCurveLoopsOptions

## Syntax (C#)
```csharp
public void Dispose()
```